#include "text.h"
#include <iostream>
#include <sstream>
#include <string>
#include <vector>
#include <algorithm>
#include "Options.h"
#include <thread>
#include <chrono>
#include <atomic>

using namespace std;


std::string items = R"(                                                                          |                           
                                                                          |                           
                                                                          |                           
                                                                          |                           
                                                                          |                           )";
std::string pasiws = R"(|                              |.
|                              |.
|                              |.
|                              |.
|                              |.)";

std::string ability = R"(                        |                                                                                                                                              |                                        |.
               |                                                                                                                                              |                                        |.
               |                                                                                                                                              |                                        |.
               |                                                                                                                                              |                                        |.
               |                                                                                                                                              |                                        |.
               |                                                                                                                                              |                                        |.
)";



std::vector<std::string> enemydefshield = { "               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              ", 
"               |                                                                                              "};

std::vector<std::string> wepdef = { "                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |.",
"                                                                                         |."};
string enemy1 = R"(               |                                                                                      .-.                                                                                             |.
               |                                                                                    (o.o)                                                                                              |.
               |                                                                                    _|=|_                                                                                              |.
               |                                                                                  //.=|=.\\                                                                                            |.
               |                                                                                 // .=|=. \\                                                                                           |.
               |                                                                                 \\ (_=_) //                                                                                           |.
               |                                                                                   (:| |:)                                                                                             |.
               |                                                                                    || ||                                                                                              |.
               |                                                                                    () ()                                                                                              |.
               |                                                                                    || ||                                                                                              |.
               |                                                                                   ==' '==                                                                                             |.)";


string enemy2 = R"(               |                                                                                       !                                                                                               |.
               |                                                                                      .-.                                                                                              |.
               |                                                                                    __|=|__                                                                                            |.
               |                                                                                   (_/`-`\_)                                                                                           |.
               |                                                                                   //\___/\\                                                                                           |.
               |                                                                                   <>/   \<>                                                                                           |.
               |                                                                                    \|_._|/                                                                                            |.
               |                                                                                     <_I_>                                                                                             |.
               |                                                                                      |||                                                                                              |.
               |                                                                                     /_|_\                                                                                             |.)";

string enemy3 = R"(               |                                                                                                 v                                                                                     |.
               |                                                                                    (__)v | v                                                                                          |.
               |                                                                                    /\/\\_|_/                                                                                          |.
               |                                                                                   _\__/  |                                                                                            |.
               |                                                                                  /  \/`\<`)                                                                                           |.
               |                                                                                  \ (  |\_/                                                                                            |.
               |                                                                                  /)))-(  |                                                                                            |.
               |                                                                                 / /^ ^ \ |                                                                                            |.
               |                                                                                /  )^/\^( |                                                                                            |.
               |                                                                                )_//`__>>                                                                                              |.)";




Hp hp = 100;

Mana mana = 100;

Shield shield = 10;

Damage PlayerSpecialDamage = 15;

Mana ManaCost = 20;

Damage PlayerDamage = 10;

Damage EndmyDamage1 = 10;
Hp EnemyHp1 = 100;

Damage EndmyDamage2 = 10;
Hp EnemyHp2 = 150;

Damage EndmyDamage3 = 20;
Hp EnemyHp3 = 200;


void studio(atomic<bool>& running) {
    for (int i = 0; i < 13; ++i) cout << endl;

    cout << R"(
                                                                                                        ,-.
                                                                                   ___,---.__          /'|`\          __,---,___
                                                                                ,-'    \`    `-.____,-'  |  `-.____,-'    //    `-.
                                                                              ,'        |           ~'\     /`~           |        `.
                                                                             /      ___//              `. ,'          ,  , \___      \
                                                                            |    ,-'   `-.__   _         |        ,    __,-'   `-.    |
                                                                            |   /          /\_  `   .    |    ,      _/\          \   |
                                                                            \  |           \ \`-.___ \   |   / ___,-'/ /           |  /
                                                                             \  \           | `._   `\\  |  //'   _,' |           /  /
                                                                              `-.\         /'  _ `---'' , . ``---' _  `\         /,-'
                                                                                 ``       /     \    ,='/ \`=.    /     \       ''
                                                                                         |__   /|\_,--.,-.--,--._/|\   __|
                                                                                         /  `./  \\`\ |  |  | /,//' \,'  \
                                                                                        /   /     ||--+--|--+-/-|     \   \
                                                                                       |   |     /'\_\_\ | /_/_/`\     |   |
                                                                                        \   \__, \_     `~'     _/ .__/   /
                                                                                         `-._,-'   `-._______,-'   `-._,-'





                                                ________                                                            _________ __            .___     .__
                                                \______ \   ____   _____   ____   ____ ___.__. ______ ____         /   _____//  |_ __ __  __| _/____ |__| ______   
                                                 |    |  \_/ __ \ /     \ /  _ \ /    <   |  |/  ___// __ \        \_____  \\   __\  |  \/ __ |/  _ \|  |/  ___/
                                                 |    `   \  ___/|  Y Y  (  <_> )   |  \___  |\___ \\  ___/         /        \|  | |  |  / /_/ (  <_> )  |\___ \               
                                                /_______  /\___  >__|_|  /\____/|___|  / ____/____  >\___  >       /_______  /|__| |____/\____ |\____/|__/____  >   
                                                        \/     \/      \/            \/\/         \/     \/                \/                 \/              \/
)";
    this_thread::sleep_for(chrono::milliseconds(100));
}

void IntroView() {
    atomic<bool> running{ true };
    thread worker(studio, ref(running));

    this_thread::sleep_for(chrono::seconds(6)); // czas trwania
    running = false;

    worker.join();
}


void title() {
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;

    cout << ends << ends << ends << ends << R"(                                                 ________  ___     ___    ___ _______   ___               ________  ________  _____ ______   _______   ________
                                                |\   __  \|\  \   |\  \  /  /|\  ___ \ |\  \             |\   ____\|\   __  \|\   _ \  _   \|\  ___ \ |\   ____\
                                                \ \  \|\  \ \  \  \ \  \/  / | \   __/|\ \  \            \ \  \___|\ \  \|\  \ \  \\\__\ \  \ \   __/|\ \  \___|_
                                                 \ \   ____\ \  \  \ \    / / \ \  \_|/_\ \  \            \ \  \  __\ \   __  \ \  \\|__| \  \ \  \_|/_\ \_____  \
                                                  \ \  \___|\ \  \  /     \/   \ \  \_|\ \ \  \____        \ \  \|\  \ \  \ \  \ \  \    \ \  \ \  \_|\ \|____|\  \
                                                   \ \__\    \ \__\/  /\   \    \ \_______\ \_______\       \ \_______\ \__\ \__\ \__\    \ \__\ \_______\____\_\  \
                                                    \|__|     \|__/__/ /\ __\    \|_______|\|_______|        \|_______|\|__|\|__|\|__|     \|__|\|_______|\_________\
                                                                  |__|/ \|__|                                                                            \|_________|
    )";
}

void options() {
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;

    cout << ends << ends << ends << ends << R"(                                                           _____             _____       _____                 _____       _____               _____
                                                          ( ___ )-----------( ___ )     ( ___ )---------------( ___ )     ( ___ )-------------( ___ )
                                                           |   |             |   |       |   |                 |   |       |   |               |   |
                                                           |   |    Play     |   |       |   |    Inventory    |   |       |   |    Enemies    |   |
                                                           |___|             |___|       |___|                 |___|       |___|               |___|
                                                          (_____)-----------(_____)     (_____)---------------(_____)     (_____)-------------(_____)
    )";


}

void input() {
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << "            											         ";
}

void viewArmor() {

    string item1 = R"(                                                    |           |--------|           |.
                                                                          |           |   ||   |           |.
                                                                          |           \===[]===/           |.
                                                                          |            \  ||  /            |.
                                                                          |             ------             |.)";

    string item2 = R"(                                                                          |      /\                      |                              |.
                                                                          |   |####==================-   |                              |.
                                                                          |      \/               )";

    string item3 = R"(                                                                          |                  \---/       |                              |.
                                                                          |      o================>      |                              |.
                                                                          |                  /___\)";


    for (int i = 0; i < 4; ++i) cout << endl;


    cout << R"(                                                                         _______________________________________________________________
                                                                        /  \                             |                              \.
                                                                       |  |              Hp:             |             Mana:            |.
                                                                        \_|    +--------------------+    |    +--------------------+    |.)" << endl;
    cout << "                                                                          |    |#########" << hp << "########|    |    |#########" << mana << "########|    |." << endl;
    cout << R"(                                                                          |    +--------------------+    |    +--------------------+    | .
                                                                          |                              |                              |.
                                                                          |______________________________|______________________________|.
                                                                          |                                                             |.
                                                                          |                                                             |.
                                                                          |                         _,.                                 |.                           
                                                                          |                        ` -.)                                |.
                                                                          |                      ( _/-\\-._                             |.
                                                                          |                     /,|`--._,-^|            ,               |.
                                                                          |                     \_| |`-._/||          ,'|               |.
                                                                          |                       |  `-, / |         /  /               |.
                                                                          |                       |     || |        /  /                |.
                                                                          |                        `r-._||/   __   /  /                 |.
                                                                          |                    __,-<_     )`-/  `./  /                  |.
                                                                          |                   '  \   `---'   \   /  /                   |.
                                                                          |                       |           |./  /                    |.
                                                                          |                       /           //  /                     |.
                                                                          |                   \_/' \         |/  /                      |.
                                                                          |                    |    |   _,^-'/  /                       |.
                                                                          |                    |    , ``  (\/  /_                       |.
                                                                          |                     \,.->._    \X-=/^                       |.
                                                                          |                     (  /   `-._//^`                         |.
                                                                          |                      `Y-.____(__}                           |.
                                                                          |                       |     {__)                            |.
                                                                          |                             ()                              |.
                                                                          |                                                             |.
                                                                          |                                                             |.
                                                                          |_____________________________________________________________|.
                                                                          |                              |                              |.)" << endl;

    showItemsAndPasiws();

    cout << R"(                                                                          |______________________________|______________________________|____
                                                                          |   /                                                             /.
                                                                          \_ /dc___________________________________________________________/.)" << endl;

}

//   _______________________________________________________________
// / \                               |                              \.
//|   |              Hp:             |             Mana:            |.
// \_ |    +--------------------+    |    +--------------------+    |.
//    |    |#########100########|    |    |#########100########|    |.
//    |    +--------------------+    |    +--------------------+    |.
//    |                              |                              |.
//    |______________________________|______________________________|.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |                                                             |.
//    |_____________________________________________________________|____
//    |   /                                                             /.
//    \_ /dc___________________________________________________________/.


void Options_of_Wepons_or_PasiweItem() {
    cout << endl;


    cout << R"(                                          _____               _____       _____                   _____       _____                    _____       _____                   _____
                                         ( ___ )-------------( ___ )     ( ___ )-----------------( ___ )     ( ___ )------------------( ___ )     ( ___ )-----------------( ___ )
                                          |   |               |   |       |   |                   |   |       |   |                    |   |       |   |                   |   |
                                          |   |    Wepons     |   |       |   |    PasiweItems    |   |       |   |    ChangePasiwe    |   |       |   |     ChangeWepon   |   |
                                          |___|               |___|       |___|                   |___|       |___|                    |___|       |___|                   |___|
                                         (_____)-------------(_____)     (_____)-----------------(_____)     (_____)------------------(_____)     (_____)-----------------(_____)                                                                                                  )" << endl;
}


namespace AsciiWeapons {
    vector<string> sword = { R"(
    
    +-----------------------------------------------------------+
    |                                                           |
    |                />_________________________________        |
    |       [########[]_________________________________>       |
    |                \>                                         |
    |                                                           |
    |  Obrażenia:                                               |
    |  30                                                       |
    |                                                           |
    |  Umiejętność:                                             |
    |  cena 30 punktów many                                     |
    |  Zadaje dodatkowe 10 obrażeń i blokuje na 1 rundę         |
    |  umiejętność wroga.                                       |
    |                                                           |
    +-----------------------------------------------------------+      
             

    +-----------------------------------------------------------+
    |                                                           |  
    |        ,  /\  .                                           |
    |       //`-||-'\\                                          |
    |      (| -=||=- |)         Obrażenia:                      |
    |       \\,-||-.//          20                              |
    |        `  ||  '                                           |
    |           ||              Umiejętność:                    |
    |           ||              cena 50 punktów many            |
    |           ||              Zadaje krytyczny cos który      |
    |           ||              zada 80 obrażeń                 |
    |           ||                                              |
    |           ()                                              |
    |                                                           |
    +-----------------------------------------------------------+


    +-----------------------------------------------------------+
    |                                                           |
    |                                                           |
    |               /\                                          |
    |   /vvvvvvvvvvvv \--------------------------------------,  | 
    |   `^^^^^^^^^^^^ /====================================="   |
    |               \/                                          |
    |                                                           |
    |                                                           |
    |  Obrażenia:                                               |
    |  20                                                       |
    |                                                           |
    |  Umiejętność:                                             |
    |  cena 60 punktów many                                     |
    |  Nakłada krwawienie na przeciwnika przez co gracz         |
    |  otrzymuje dodatkowe 10 hp i zadaje przeciwnikowi         |
    |  40 obrażeń                                               |
    |                                                           |
    +-----------------------------------------------------------+   
    )"

    };

    void viewWeapon(const vector<string>& weapon) {
        for (const auto& linia : weapon) {
            cout << linia << endl;
        }
    }

    vector<string> shields = { R"(
    +-----------------------------------------------------------+
    |                                                           |  
    |            _..._                                          |
    |        .-'_.---._'-.                                      |
    |        ||####|(__)||        Ochrona:                      |
    |        ((####|(**)))        50                            |
    |         '\###|_''/'                                       |
    |          \\()|##//          Pasywna Umiejętność:          |
    |           \\ |#//           Dodaje 30 do maksymalnego     |
    |            .\_/.            zdrowia.                      |
    |             L.J                                           |
    |              "                                            |
    |                                                           |
    +-----------------------------------------------------------+


    +-----------------------------------------------------------+
    |                                                           |  
    |       |`-._/\_.-`|                                        |
    |       |    ||    |           Ochrona:                     |
    |       |___o()o___|           65                           |
    |       |__((<>))__|                                        |
    |       \   o\/o   /           Pasywna Umiejętność:         |
    |        \   ||   /            Dodaje do zdrowia 15 i do    |
    |         \  ||  /             many 15                      |
    |          '.||.'                                           |
    |            ``                                             |
    |                                                           |
    +-----------------------------------------------------------+


    +-----------------------------------------------------------+
    |                                                           |  
    |         |\ _..--.._ /|                                    |
    |         |############|                                    |
    |          )##########(        Ochrona:                     |
    |       ._/##.'//\\'.##\_.     50                           |
    |        .__)#((()))#(__.                                   |
    |         \##'.\\//.'##/       Pasywna Umiejętność:         |
    |          \####\/####/        Dodaje 30 do maksymalnej     |
    |          /,.######.,\        ilości many                  |
    |         (  \##__##/  )                                    |
    |             "(\/)'                                        |
    |               )(|                                         |
    |                                                           |
    +-----------------------------------------------------------+
    )"
    };

    void viewPasiweItem(const vector<string>& pasiws) {
        for (const auto& linia : pasiws) {
            cout << linia << endl;
        }
    }
}

void showItemsAndPasiws() {
    vector<string> lines_items;
    vector<string> lines_pasiws;

    stringstream ss_items(items);
    stringstream ss_pasiws(pasiws);

    string line;

    while (getline(ss_items, line)) {
        lines_items.push_back(line);
    }

    while (getline(ss_pasiws, line)) {
        lines_pasiws.push_back(line);
    }


    size_t max_lines = max(lines_items.size(), lines_pasiws.size());

    for (size_t i = 0; i < max_lines; ++i) {
        if (i < lines_items.size()) {
            cout << lines_items[i];
        }
        else {
            cout << string(74, ' ');
        }

        cout << "   ";

        if (i < lines_pasiws.size()) {
            cout << lines_pasiws[i];
        }

        cout << endl;
    }
}

void Layer1Function(atomic<bool>& running) {
    for (int i = 0; i < 21; ++i) cout << endl;

    cout << R"(                                                                         __      ______   __    __  ____    ____           _     
                                                                            /\ \    /\  _  \ /\ \  /\ \/\  _`\ /\  _`\       /' \    
                                                                            \ \ \   \ \ \L\ \\ `\`\\/'/\ \ \L\_\ \ \L\ \    /\_, \   
                                                                             \ \ \  _\ \  __ \`\ `\ /'  \ \  _\L\ \ ,  /    \/_/\ \  
                                                                              \ \ \L\ \ \ \/\ \ `\ \ \   \ \ \L\ \ \ \\ \      \ \ \ 
                                                                               \ \____/\ \_\ \_\  \ \_\   \ \____/\ \_\ \_\     \ \_\
                                                                                \/___/  \/_/\/_/   \/_/    \/___/  \/_/\/ /      \/_/
                                                         
                                                         
)";
    this_thread::sleep_for(chrono::milliseconds(100)); // interwał
}

void Layer1View() {
    atomic<bool> running{ true };
    thread worker(Layer1Function, ref(running));

    this_thread::sleep_for(chrono::seconds(3)); // czas trwania
    running = false;

    worker.join();
}

void Layer2Function(atomic<bool>& running) {
    for (int i = 0; i < 21; ++i) cout << endl;

    cout << R"(                                                                          __                                              ___     
                                                                         /\ \                                           /'___`\   
                                                                         \ \ \         __    __  __     __   _ __      /\_\ /\ \  
                                                                          \ \ \  __  /'__`\ /\ \/\ \  /'__`\/\`'__\    \/_/// /__ 
                                                                           \ \ \L\ \/\ \L\.\\ \ \_\ \/\  __/\ \ \/        // /_\ \
                                                                            \ \____/\ \__/.\_\/`____ \ \____\\ \_\       /\______/
                                                                             \/___/  \/__/\/_/`/___/> \/____/ \/_/       \/_____/ 
                                                                                                 /\___/                           
                                                                                                 \/__/                            
)";
    this_thread::sleep_for(chrono::milliseconds(100)); // interwał
}

void Layer2View() {
    atomic<bool> running{ true };
    thread worker(Layer2Function, ref(running));

    this_thread::sleep_for(chrono::seconds(3)); // czas trwania
    running = false;

    worker.join();
}

void Layer3Function(atomic<bool>& running) {
    for (int i = 0; i < 21; ++i) cout << endl;

    cout << R"(                                                                          __                                             __     
                                                                         /\ \                                          /'__`\   
                                                                         \ \ \         __    __  __     __   _ __     /\_\L\ \  
                                                                          \ \ \  __  /'__`\ /\ \/\ \  /'__`\/\`'__\   \/_/_\_<_ 
                                                                           \ \ \L\ \/\ \L\.\\ \ \_\ \/\  __/\ \ \/      /\ \L\ \
                                                                            \ \____/\ \__/.\_\/`____ \ \____\\ \_\      \ \____/
                                                                             \/___/  \/__/\/_/`/___/> \/____/ \/_/       \/___/ 
                                                                                                /\___/                         
                                                                                                \/__/                          
)";
    this_thread::sleep_for(chrono::milliseconds(100)); // interwał
}

void Layer3View() {
    atomic<bool> running{ true };
    thread worker(Layer3Function, ref(running));

    this_thread::sleep_for(chrono::seconds(3)); // czas trwania
    running = false;

    worker.join();
}

void View_of_fight() {
                   
    cout << R"(             _________________________________________________________________________________________________________________________________________________________________________________________)" << endl;
    cout << R"(            /  \   Enemy Stats       EnemyDamage: )" << EndmyDamage1 << "                                                   |   Your Stats       PlayerDamege: " << PlayerDamage << "       SpecialAttack: " << AbilityCount << R"(                                   \.)" << endl;
    cout << R"(           |   |                                        Hp:                                            |               Shield                         Hp:                        Mana:                 |.
            \__|                           +--------------------------+                                |         +---------------------+     +---------------------+     +---------------------+       |.)" << endl;
    cout << "               |                           |###########" << EnemyHp1 << "############|                                |         |##########" << shield << "#########|     |#########" << hp << "#########|     |#########" << mana << "#########|       |." << endl;
    cout << R"(               |                           +--------------------------+                                |         +---------------------+     +---------------------+     +---------------------+       |.
               |_______________________________________________________________________________________|_______________________________________________________________________________________________|.
               |                                                                                                                                                                                       |.)" << endl;
    cout << enemy1 << endl;
    for (size_t i = 0; i < enemydefshield.size(); ++i) {
        cout << enemydefshield[i] << wepdef[i] << endl;
    }

    cout << R"(               |_______________________________________________________________________________________________________________________________________________________________________________________|.
               |                                                                                                                                              |                                        |.)";
    cout << ability;
    cout << R"(               |______________________________________________________________________________________________________________________________________________|________________________________________|____
               |   /                                                                                                                                                                                       /.
               \_ /dc_____________________________________________________________________________________________________________________________________________________________________________________/.
)";
}

void View_fight_options() {
    cout << R"(                                   _____                      _____       _____                    _____       _____                       _____       _____                 _____
                                  ( ___ )--------------------( ___ )     ( ___ )------------------( ___ )     ( ___ )---------------------( ___ )     ( ___ )---------------( ___ )  
                                   |   |                      |   |       |   |                    |   |       |   |                       |   |       |   |                 |   |
                                   |   |    Normal Attack     |   |       |   |    Super Attack    |   |       |   |    Use Pasiwe Item    |   |       |   |    End Round    |   |
                                   |___|                      |___|       |___|                    |___|       |___|                       |___|       |___|                 |___|
                                  (_____)--------------------(_____)     (_____)------------------(_____)     (_____)---------------------(_____)     (_____)---------------(_____)    
    )";
}

void Victory() {
    cout << R"(                                                                                 ___      ___ ___  ________ _________  ________  ________      ___    ___ 
                                                                                 |\  \    /  /|\  \|\   ____\\___   ___\\   __  \|\   __  \    |\  \  /  /|
                                                                                 \ \  \  /  / | \  \ \  \___\|___ \  \_\ \  \|\  \ \  \|\  \   \ \  \/  / /
                                                                                  \ \  \/  / / \ \  \ \  \       \ \  \ \ \  \\\  \ \   _  _\   \ \    / / 
                                                                                   \ \    / /   \ \  \ \  \____   \ \  \ \ \  \\\  \ \  \\  \|   \/  /  /  
                                                                                    \ \__/ /     \ \__\ \_______\  \ \__\ \ \_______\ \__\\ _\ __/  / /    
                                                                                     \|__|/       \|__|\|_______|   \|__|  \|_______|\|__|\|__|\___/ /     
                                                                                                                                              \|___|/      )";
}

void GameOver() {
    cout << R"(                                                                                 ________  ________  _____ ______   _______          ________  ___      ___ _______   ________             
                                                                                 |\   ____\|\   __  \|\   _ \  _   \|\  ___ \          |\   __  \|\  \    /  /|\  ___ \ |\   __  \           
                                                                                 \ \  \___|\ \  \|\  \ \  \\\__\ \  \ \   __/|         \ \  \|\  \ \  \  /  / | \   __/|\ \  \|\  \
                                                                                  \ \  \  __\ \   __  \ \  \\|__| \  \ \  \_|/__        \ \  \\\  \ \  \/  / / \ \  \_|/_\ \   _  _\ 
                                                                                   \ \  \|\  \ \  \ \  \ \  \    \ \  \ \  \_|\ \        \ \  \\\  \ \    / /   \ \  \_|\ \ \  \\  \| 
                                                                                    \ \_______\ \__\ \__\ \__\    \ \__\ \_______\        \ \_______\ \__/ /     \ \_______\ \__\\ _\   
                                                                                     \|_______|\|__|\|__|\|__|     \|__|\|_______|         \|_______|\|__|/       \|_______|\|__|\|__|                         )";
}

